go_debug.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-09-20 二 10:26 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>golang调试工具</title>
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="./css/org-css.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">golang调试工具</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline2">1. 调试工具gdb</a>
<ul>
<li><a href="#orgheadline1">1.1. gdb 调试go程序</a></li>
</ul>
</li>
<li><a href="#orgheadline3">2. golang 调试工具delve</a></li>
<li><a href="#orgheadline4">3. 相关链接</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">1</span> 调试工具gdb</h2>
<div class="outline-text-2" id="text-1">
<p>
gdb 是一个调试工具，可以调试很多种语言，当然其中就有golang。由于gdb不能显示go的数据类型，所以在go的runtime源码下有一个python代码文件,runtime-gdb.py，提供给gdb一个扩展。
</p>
</div>
