org/go_debug.org
** gdb 调试go程序
先写一个很简单的小程序
#+BEGIN_SRC go
package main

import (
	"fmt"
)

func main() {
	b := make(map[string]string)
	b["write"] = "write"
	b["black"] = "black"
	fmt.Println(b)
}
#+END_SRC

#+BEGIN_SRC shell 
go build -gcflags "-N -l" test8.go
#+END_SRC
编译代码，-gcflags是给go编译器的参数，gc是go compile的意思。-N是不要优化代码，-l 是禁止内联代码。
#+BEGIN_SRC fundamental
> gdb test8
GNU gdb (Ubuntu 7.10-1ubuntu2) 7.10
Copyright (C) 2015 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from test8...done.
warning: File "/home/47/go/src/runtime/runtime-gdb.py" auto-loading has been declined by your `auto-load safe-path' set to "$debugdir:$datadir/auto-load".
To enable execution of this file add
	add-auto-load-safe-path /home/47/go/src/runtime/runtime-gdb.py
line to your configuration file "/home/47/.gdbinit".
To completely disable this security protection add
	set auto-load safe-path /
line to your configuration file "/home/47/.gdbinit".
For more information about this security protection see the
"Auto-loading safe path" section in the GDB manual.  E.g., run from the shell:
	info "(gdb)Auto-loading safe path"
(gdb) info files
Symbols from "/home/47/code/golang/src/test3/test8".
Local exec file:
	`/home/47/code/golang/src/test3/test8', file type elf64-x86-64.
	Entry point: 0x456750
	0x0000000000401000 - 0x00000000004aa960 is .text
	0x00000000004ab000 - 0x000000000052dc62 is .rodata
	0x000000000052dc68 - 0x000000000052fd28 is .typelink
	0x000000000052fd28 - 0x000000000052fd28 is .gosymtab
	0x000000000052fd40 - 0x00000000005800d8 is .gopclntab
	0x0000000000581000 - 0x0000000000582ce8 is .noptrdata
	0x0000000000582d00 - 0x0000000000585250 is .data
	0x0000000000585260 - 0x000000000059fab8 is .bss
	0x000000000059fac0 - 0x00000000005a48c0 is .noptrbss
	0x0000000000400fc8 - 0x0000000000401000 is .note.go.buildid
(gdb) l main.main
2	
3	import (
4		"fmt"
5	)
6	
7	func main() {
8		fmt.Println("begin===============")
9		b := make(map[string]string)
10		b["write"] = "write"
11		b["black"] = "black"
(gdb) b 10
Breakpoint 1 at 0x401151: file /home/jyk-47/code/golang/src/test3/test8.go, line 10.
(gdb) r
Starting program: /home/jyk-47/code/golang/src/test3/test8 
[New LWP 21285]
[New LWP 21286]
[New LWP 21287]
begin===============

Breakpoint 1, main.main () at /home/jyk-47/code/golang/src/test3/test8.go:10
10		b["write"] = "write"
(gdb) l
5	)
6	
7	func main() {
8		fmt.Println("begin===============")
9		b := make(map[string]string)
10		b["write"] = "write"
11		b["black"] = "black"
12		fmt.Println(b)
13	}
(gdb) p b
$1 = (map[string]string) 0xc8200121e0
(gdb) p *b
$2 = {count = 0, flags = 0 '\000', B = 0 '\000', hash0 = 1888351057, buckets = 0x0, oldbuckets = 0x0, nevacuate = 0, overflow = 0x0}
(gdb) n
11		b["black"] = "black"
(gdb) bt
#0  main.main () at /home/jyk-47/code/golang/src/test3/test8.go:11
(gdb) bp
#+END_SRC
可以看到上面已经加载了golang的扩展脚本runtime-gdb.py, l main.main 是查看main函数的源码，b 10 在第10行设置断点。r 运行程序。p b 是打印变量。n 是单步。gdb不能打印go中map具体的内容，只能够打印map底层的结构，用起来有点不爽。
