go_debug.html
<div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> gdb 调试go程序</h3>
<div class="outline-text-3" id="text-1-1">
<p>
先写一个很简单的小程序
</p>
<div class="org-src-container">

<pre class="src src-go"><span style="color: #F92672;">package</span> main

<span style="color: #F92672;">import</span> <span style="color: #AE81FF;">(</span>
  <span style="color: #E6DB74;">"fmt"</span>
<span style="color: #AE81FF;">)</span>

<span style="color: #F92672;">func</span> <span style="color: #A6E22E;">main</span><span style="color: #AE81FF;">()</span> <span style="color: #AE81FF;">{</span>
  b := <span style="color: #F92672;">make</span><span style="color: #66D9EF;">(</span><span style="color: #F92672;">map</span><span style="color: #A6E22E;">[</span><span style="color: #66D9EF;">string</span><span style="color: #A6E22E;">]</span><span style="color: #66D9EF;">string</span><span style="color: #66D9EF;">)</span>
  b<span style="color: #66D9EF;">[</span><span style="color: #E6DB74;">"write"</span><span style="color: #66D9EF;">]</span> = <span style="color: #E6DB74;">"write"</span>
  b<span style="color: #66D9EF;">[</span><span style="color: #E6DB74;">"black"</span><span style="color: #66D9EF;">]</span> = <span style="color: #E6DB74;">"black"</span>
  fmt.<span style="color: #A6E22E;">Println</span><span style="color: #66D9EF;">(</span>b<span style="color: #66D9EF;">)</span>
<span style="color: #AE81FF;">}</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-shell">go build -gcflags <span style="color: #E6DB74;">"-N -l"</span> test8.go
</pre>
</div>
<p>
编译代码，-gcflags是给go编译器的参数，gc是go compile的意思。-N是不要优化代码，-l 是禁止内联代码。
</p>
<div class="org-src-container">

<pre class="src src-fundamental">&gt; gdb test8
GNU gdb (Ubuntu 7.10-1ubuntu2) 7.10
Copyright (C) 2015 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <a href="http://gnu.org/licenses/gpl.html&gt;
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type &quot;show copying&quot;
and &quot;show warranty&quot; for details.
This GDB was configured as &quot;x86_64-linux-gnu&quot;.
Type &quot;show configuration&quot; for configuration details.
For bug reporting instructions, please see:
&lt;http://www.gnu.org/software/gdb/bugs/&gt;.
Find the GDB manual and other documentation resources online at:
&lt;http://www.gnu.org/software/gdb/documentation/">&lt;http://gnu.org/licenses/gpl.html&gt;
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type </a><span style="color: #E6DB74;"><a href="http://gnu.org/licenses/gpl.html&gt;
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type &quot;show copying&quot;
and &quot;show warranty&quot; for details.
This GDB was configured as &quot;x86_64-linux-gnu&quot;.
Type &quot;show configuration&quot; for configuration details.
For bug reporting instructions, please see:
&lt;http://www.gnu.org/software/gdb/bugs/&gt;.
Find the GDB manual and other documentation resources online at:
&lt;http://www.gnu.org/software/gdb/documentation/">"show copying"</a></span><a href="http://gnu.org/licenses/gpl.html&gt;
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type &quot;show copying&quot;
and &quot;show warranty&quot; for details.
This GDB was configured as &quot;x86_64-linux-gnu&quot;.
Type &quot;show configuration&quot; for configuration details.
For bug reporting instructions, please see:
&lt;http://www.gnu.org/software/gdb/bugs/&gt;.
Find the GDB manual and other documentation resources online at:
&lt;http://www.gnu.org/software/gdb/documentation/">
and </a><span style="color: #E6DB74;"><a href="http://gnu.org/licenses/gpl.html&gt;
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type &quot;show copying&quot;
and &quot;show warranty&quot; for details.
This GDB was configured as &quot;x86_64-linux-gnu&quot;.
Type &quot;show configuration&quot; for configuration details.
For bug reporting instructions, please see:
&lt;http://www.gnu.org/software/gdb/bugs/&gt;.
Find the GDB manual and other documentation resources online at:
&lt;http://www.gnu.org/software/gdb/documentation/">"show warranty"</a></span><a href="http://gnu.org/licenses/gpl.html&gt;
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type &quot;show copying&quot;
and &quot;show warranty&quot; for details.
This GDB was configured as &quot;x86_64-linux-gnu&quot;.
Type &quot;show configuration&quot; for configuration details.
For bug reporting instructions, please see:
&lt;http://www.gnu.org/software/gdb/bugs/&gt;.
Find the GDB manual and other documentation resources online at:
&lt;http://www.gnu.org/software/gdb/documentation/"> for details.
This GDB was configured as </a><span style="color: #E6DB74;"><a href="http://gnu.org/licenses/gpl.html&gt;
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type &quot;show copying&quot;
and &quot;show warranty&quot; for details.
This GDB was configured as &quot;x86_64-linux-gnu&quot;.
Type &quot;show configuration&quot; for configuration details.
For bug reporting instructions, please see:
&lt;http://www.gnu.org/software/gdb/bugs/&gt;.
Find the GDB manual and other documentation resources online at:
&lt;http://www.gnu.org/software/gdb/documentation/">"x86_64-linux-gnu"</a></span><a href="http://gnu.org/licenses/gpl.html&gt;
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type &quot;show copying&quot;
and &quot;show warranty&quot; for details.
This GDB was configured as &quot;x86_64-linux-gnu&quot;.
Type &quot;show configuration&quot; for configuration details.
For bug reporting instructions, please see:
&lt;http://www.gnu.org/software/gdb/bugs/&gt;.
Find the GDB manual and other documentation resources online at:
&lt;http://www.gnu.org/software/gdb/documentation/">.
Type </a><span style="color: #E6DB74;"><a href="http://gnu.org/licenses/gpl.html&gt;
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type &quot;show copying&quot;
and &quot;show warranty&quot; for details.
This GDB was configured as &quot;x86_64-linux-gnu&quot;.
Type &quot;show configuration&quot; for configuration details.
For bug reporting instructions, please see:
&lt;http://www.gnu.org/software/gdb/bugs/&gt;.
Find the GDB manual and other documentation resources online at:
&lt;http://www.gnu.org/software/gdb/documentation/">"show configuration"</a></span><a href="http://gnu.org/licenses/gpl.html&gt;
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type &quot;show copying&quot;
and &quot;show warranty&quot; for details.
This GDB was configured as &quot;x86_64-linux-gnu&quot;.
Type &quot;show configuration&quot; for configuration details.
For bug reporting instructions, please see:
&lt;http://www.gnu.org/software/gdb/bugs/&gt;.
Find the GDB manual and other documentation resources online at:
&lt;http://www.gnu.org/software/gdb/documentation/"> for configuration details.
For bug reporting instructions, please see:
&lt;http://www.gnu.org/software/gdb/bugs/&gt;.
Find the GDB manual and other documentation resources online at:
&lt;http://www.gnu.org/software/gdb/documentation/&gt;</a>.
For help, type <span style="color: #E6DB74;">"help"</span>.
Type <span style="color: #E6DB74;">"apropos word"</span> to search for commands related to <span style="color: #E6DB74;">"word"</span>...
Reading symbols from test8...done.
warning: File <span style="color: #E6DB74;">"/home/47/go/src/runtime/runtime-gdb.py"</span> auto-loading has been declined by your `auto-load safe-path' set to <span style="color: #E6DB74;">"$debugdir:$datadir/auto-load"</span>.
To enable execution of this file add
  add-auto-load-safe-path /home/47/go/src/runtime/runtime-gdb.py
line to your configuration file <span style="color: #E6DB74;">"/home/47/.gdbinit"</span>.
To completely disable this security protection add
  set auto-load safe-path /
line to your configuration file <span style="color: #E6DB74;">"/home/47/.gdbinit"</span>.
For more information about this security protection see the
<span style="color: #E6DB74;">"Auto-loading safe path"</span> section in the GDB manual.  E.g., run from the shell:
  info <span style="color: #E6DB74;">"(gdb)Auto-loading safe path"</span>
(gdb) info files
Symbols from <span style="color: #E6DB74;">"/home/47/code/golang/src/test3/test8"</span>.
Local exec file:
  `/home/47/code/golang/src/test3/test8', file type elf64-x86-64.
  Entry point: 0x456750
  0x0000000000401000 - 0x00000000004aa960 is .text
  0x00000000004ab000 - 0x000000000052dc62 is .rodata
  0x000000000052dc68 - 0x000000000052fd28 is .typelink
  0x000000000052fd28 - 0x000000000052fd28 is .gosymtab
  0x000000000052fd40 - 0x00000000005800d8 is .gopclntab
  0x0000000000581000 - 0x0000000000582ce8 is .noptrdata
  0x0000000000582d00 - 0x0000000000585250 is .data
  0x0000000000585260 - 0x000000000059fab8 is .bss
  0x000000000059fac0 - 0x00000000005a48c0 is .noptrbss
  0x0000000000400fc8 - 0x0000000000401000 is .note.go.buildid
(gdb) l main.main
2 
3 import (
4   <span style="color: #E6DB74;">"fmt"</span>
5 )
6 
7 func main() {
8   fmt.Println(<span style="color: #E6DB74;">"begin==============="</span>)
9   b := make(map[string]string)
10    b[<span style="color: #E6DB74;">"write"</span>] = <span style="color: #E6DB74;">"write"</span>
11    b[<span style="color: #E6DB74;">"black"</span>] = <span style="color: #E6DB74;">"black"</span>
(gdb) b 10
Breakpoint 1 at 0x401151: file /home/jyk-47/code/golang/src/test3/test8.go, line 10.
(gdb) r
Starting program: /home/jyk-47/code/golang/src/test3/test8 
[New LWP 21285]
[New LWP 21286]
[New LWP 21287]
begin===============

Breakpoint 1, main.main () at /home/jyk-47/code/golang/src/test3/test8.go:10
10    b[<span style="color: #E6DB74;">"write"</span>] = <span style="color: #E6DB74;">"write"</span>
(gdb) l
5 )
6 
7 func main() {
8   fmt.Println(<span style="color: #E6DB74;">"begin==============="</span>)
9   b := make(map[string]string)
10    b[<span style="color: #E6DB74;">"write"</span>] = <span style="color: #E6DB74;">"write"</span>
11    b[<span style="color: #E6DB74;">"black"</span>] = <span style="color: #E6DB74;">"black"</span>
12    fmt.Println(b)
13  }
(gdb) p b
$1 = (map[string]string) 0xc8200121e0
(gdb) p *b
$2 = {count = 0, flags = 0 '\000', B = 0 '\000', hash0 = 1888351057, buckets = 0x0, oldbuckets = 0x0, nevacuate = 0, overflow = 0x0}
(gdb) n
11    b[<span style="color: #E6DB74;">"black"</span>] = <span style="color: #E6DB74;">"black"</span>
(gdb) bt
#0  main.main () at /home/jyk-47/code/golang/src/test3/test8.go:11
(gdb) bp
</pre>
</div>
<p>
可以看到上面已经加载了golang的扩展脚本runtime-gdb.py, l main.main 是查看main函数的源码，b 10 在第10行设置断点。r 运行程序。p b 是打印变量。n 是单步。gdb不能打印go中map具体的内容，只能够打印map底层的结构，用起来有点不爽。
</p>
</div>
</div>
</div>
