org/go_debug.org
* golang 调试工具delve
由于gdb对golang支持比较差，只能支持一些简单的功能,比如断点，单步等，但对goroutine, 内置对象的打印等还是不怎么好。所以go有了自己的debug工具delve。安装等可以参考官方文档：https://github.com/derekparker/delve.
#+BEGIN_SRC shell
Delve is a source level debugger for Go programs.

Delve enables you to interact with your program by controlling the execution of the process,
evaluating variables, and providing information of thread / goroutine state, CPU register state and more.

The goal of this tool is to provide a simple yet powerful interface for debugging Go programs.

Usage:
  dlv [command]

Available Commands:
  attach      Attach to running process and begin debugging.
  connect     Connect to a headless debug server.
  debug       Compile and begin debugging main package in current directory, or the package specified.
  exec        Execute a precompiled binary, and begin a debug session.
  run         Deprecated command. Use 'debug' instead.
  test        Compile test binary and begin debugging program.
  trace       Compile and begin tracing program.
  version     Prints version.

Flags:
      --accept-multiclient[=false]: Allows a headless server to accept multiple client connections. Note that the server API is not reentrant and clients will have to coordinate.
      --api-version=1: Selects API version when headless.
      --build-flags="": Build flags, to be passed to the compiler.
      --headless[=false]: Run debug server only, in headless mode.
  -h, --help[=false]: help for dlv
      --init="": Init file, executed by the terminal client.
  -l, --listen="localhost:0": Debugging server listen address.
      --log[=false]: Enable debugging server logging.

Use "dlv [command] --help" for more information about a command.
#+END_SRC
delve 的帮助文档说的非常清楚。我们还是用上面的那个例子来说明.
#+BEGIN_SRC shell
> dlv exec ./test8
Type 'help' for list of commands.
//查看主函数的代码
(dlv) ls main.main 
   2:	
   3:	import (
   4:		"fmt"
   5:	)
   6:	
   7:	func main() {
   8:		fmt.Println("begin===============")
   9:		b := make(map[string]string)
  10:		b["write"] = "write"
  11:		b["black"] = "black"
  12:		fmt.Println(b)
//设置断点
(dlv) b main.main
Breakpoint 1 set at 0x40101b for main.main() ./test8.go:7
//运行到断点处
(dlv) c
> main.main() ./test8.go:7 (hits goroutine(1):1 total:1) (PC: 0x40101b)
     2:	
     3:	import (
     4:		"fmt"
     5:	)
     6:	
=>   7:	func main() {
     8:		fmt.Println("begin===============")
     9:		b := make(map[string]string)
    10:		b["write"] = "write"
    11:		b["black"] = "black"
    12:		fmt.Println(b)
//单步执行
(dlv) n
> main.main() ./test8.go:8 (PC: 0x401022)
     3:	import (
     4:		"fmt"
     5:	)
     6:	
     7:	func main() {
=>   8:		fmt.Println("begin===============")
     9:		b := make(map[string]string)
    10:		b["write"] = "write"
    11:		b["black"] = "black"
    12:		fmt.Println(b)
    13:	}
(dlv) 
begin===============
> main.main() ./test8.go:9 (PC: 0x40111c)
     4:		"fmt"
     5:	)
     6:	
     7:	func main() {
     8:		fmt.Println("begin===============")
=>   9:		b := make(map[string]string)
    10:		b["write"] = "write"
    11:		b["black"] = "black"
    12:		fmt.Println(b)
    13:	}
(dlv) n
> main.main() ./test8.go:10 (PC: 0x401151)
     5:	)
     6:	
     7:	func main() {
     8:		fmt.Println("begin===============")
     9:		b := make(map[string]string)
=>  10:		b["write"] = "write"
    11:		b["black"] = "black"
    12:		fmt.Println(b)
    13:	}
(dlv) n
> main.main() ./test8.go:11 (PC: 0x4011bb)
     6:	
     7:	func main() {
     8:		fmt.Println("begin===============")
     9:		b := make(map[string]string)
    10:		b["write"] = "write"
=>  11:		b["black"] = "black"
    12:		fmt.Println(b)
    13:	}
//打印b的值
(dlv) p b
map[string]string [
	"write": "write", 
]
(dlv) 
#+END_SRC
dlv还提供一些命令，总的来说对于简单的调试足够了。用起来还是比较方便, 不过如果调试go汇编代码，就有点不足，-0- 单步都不能使用。
