go_debug.html
<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">2</span> golang 调试工具delve</h2>
<div class="outline-text-2" id="text-2">
<p>
由于gdb对golang支持比较差，只能支持一些简单的功能,比如断点，单步等，但对goroutine, 内置对象的打印等还是不怎么好。所以go有了自己的debug工具delve。安装等可以参考官方文档：<a href="https://github.com/derekparker/delve">https://github.com/derekparker/delve</a>.
</p>
<div class="org-src-container">

<pre class="src src-shell">Delve is a source level debugger for Go programs.

Delve enables you to interact with your program by controlling the execution of the process,
evaluating variables, and providing information of thread / goroutine state, CPU register state and more.

The goal of this tool is to provide a simple yet powerful interface for debugging Go programs.

Usage:
  dlv <span style="color: #AE81FF;">[</span>command<span style="color: #AE81FF;">]</span>

Available Commands:
  attach      Attach to running process and begin debugging.
  connect     Connect to a headless debug server.
  debug       Compile and begin debugging main package<span style="color: #F92672;"> in</span> current directory, or the package specified.
  <span style="color: #F92672;">exec</span>        Execute a precompiled binary, and begin a debug session.
  run         Deprecated command. Use <span style="color: #E6DB74;">'debug'</span> instead.
  test        Compile test binary and begin debugging program.
  trace       Compile and begin tracing program.
  version     Prints version.

Flags:
      --accept-multiclient<span style="color: #AE81FF;">[</span>=false<span style="color: #AE81FF;">]</span>: Allows a headless server to accept multiple client connections. Note that the server API is not reentrant and clients will have to coordinate.
      --api-version=<span style="color: #AE81FF;">1:</span> Selects API version when headless.
      --build-flags=<span style="color: #E6DB74;">""</span>: Build flags, to be passed to the compiler.
      --headless<span style="color: #AE81FF;">[</span>=false<span style="color: #AE81FF;">]</span>: Run debug server only,<span style="color: #F92672;"> in</span> headless mode.
  -h, --help<span style="color: #AE81FF;">[</span>=false<span style="color: #AE81FF;">]</span>: help for dlv
      --init=<span style="color: #E6DB74;">""</span>: Init file, executed by the terminal client.
  -l, --listen=<span style="color: #E6DB74;">"localhost:0"</span>: Debugging server listen address.
      --log<span style="color: #AE81FF;">[</span>=false<span style="color: #AE81FF;">]</span>: Enable debugging server logging.

Use <span style="color: #E6DB74;">"dlv [command] --help"</span> for more information about a command.
</pre>
</div>
<p>
delve 的帮助文档说的非常清楚。我们还是用上面的那个例子来说明.
</p>
<div class="org-src-container">

<pre class="src src-shell">&gt; dlv exec ./test8
Type <span style="color: #E6DB74;">'help'</span> for list of commands.
//&#26597;&#30475;&#20027;&#20989;&#25968;&#30340;&#20195;&#30721;
<span style="color: #AE81FF;">(</span>dlv<span style="color: #AE81FF;">)</span> ls main.main 
   <span style="color: #AE81FF;">2:</span> 
   <span style="color: #AE81FF;">3:</span> import <span style="color: #AE81FF;">(</span>
   <span style="color: #AE81FF;">4:</span>   <span style="color: #E6DB74;">"fmt"</span>
   <span style="color: #AE81FF;">5:</span> <span style="color: #AE81FF;">)</span>
   <span style="color: #AE81FF;">6:</span> 
   <span style="color: #AE81FF;">7:</span> func main<span style="color: #AE81FF;">()</span> <span style="color: #AE81FF;">{</span>
   <span style="color: #AE81FF;">8:</span>   fmt.Println<span style="color: #66D9EF;">(</span><span style="color: #E6DB74;">"begin==============="</span><span style="color: #66D9EF;">)</span>
   <span style="color: #AE81FF;">9:</span>   b := make<span style="color: #66D9EF;">(</span>map<span style="color: #A6E22E;">[</span>string<span style="color: #A6E22E;">]</span>string<span style="color: #66D9EF;">)</span>
  <span style="color: #AE81FF;">10:</span>   <span style="color: #FD971F;">b</span><span style="color: #66D9EF;">[</span><span style="color: #E6DB74;">"write"</span><span style="color: #66D9EF;">]</span> = <span style="color: #E6DB74;">"write"</span>
  <span style="color: #AE81FF;">11:</span>   <span style="color: #FD971F;">b</span><span style="color: #66D9EF;">[</span><span style="color: #E6DB74;">"black"</span><span style="color: #66D9EF;">]</span> = <span style="color: #E6DB74;">"black"</span>
  <span style="color: #AE81FF;">12:</span>   fmt.Println<span style="color: #66D9EF;">(</span>b<span style="color: #66D9EF;">)</span>
//&#35774;&#32622;&#26029;&#28857;
<span style="color: #66D9EF;">(</span>dlv<span style="color: #66D9EF;">)</span> b main.main
Breakpoint <span style="color: #AE81FF;">1</span> set at <span style="color: #AE81FF;">0x40101b</span> for main.main<span style="color: #66D9EF;">()</span> ./test8.go:7
//&#36816;&#34892;&#21040;&#26029;&#28857;&#22788;
<span style="color: #66D9EF;">(</span>dlv<span style="color: #66D9EF;">)</span> c
&gt; main.main<span style="color: #66D9EF;">()</span> ./test8.go:7 <span style="color: #66D9EF;">(</span>hits goroutine<span style="color: #A6E22E;">(</span><span style="color: #AE81FF;">1</span><span style="color: #A6E22E;">)</span>:1 total:1<span style="color: #66D9EF;">)</span> <span style="color: #66D9EF;">(</span>PC: <span style="color: #AE81FF;">0x40101b</span><span style="color: #66D9EF;">)</span>
     <span style="color: #AE81FF;">2:</span> 
     <span style="color: #AE81FF;">3:</span> import <span style="color: #66D9EF;">(</span>
     <span style="color: #AE81FF;">4:</span>   <span style="color: #E6DB74;">"fmt"</span>
     <span style="color: #AE81FF;">5:</span> <span style="color: #66D9EF;">)</span>
     <span style="color: #AE81FF;">6:</span> 
=&gt;   <span style="color: #AE81FF;">7:</span> func main<span style="color: #66D9EF;">()</span> <span style="color: #66D9EF;">{</span>
     <span style="color: #AE81FF;">8:</span>   fmt.Println<span style="color: #A6E22E;">(</span><span style="color: #E6DB74;">"begin==============="</span><span style="color: #A6E22E;">)</span>
     <span style="color: #AE81FF;">9:</span>   b := make<span style="color: #A6E22E;">(</span>map<span style="color: #E6DB74;">[</span>string<span style="color: #E6DB74;">]</span>string<span style="color: #A6E22E;">)</span>
    <span style="color: #AE81FF;">10:</span>   <span style="color: #FD971F;">b</span><span style="color: #A6E22E;">[</span><span style="color: #E6DB74;">"write"</span><span style="color: #A6E22E;">]</span> = <span style="color: #E6DB74;">"write"</span>
    <span style="color: #AE81FF;">11:</span>   <span style="color: #FD971F;">b</span><span style="color: #A6E22E;">[</span><span style="color: #E6DB74;">"black"</span><span style="color: #A6E22E;">]</span> = <span style="color: #E6DB74;">"black"</span>
    <span style="color: #AE81FF;">12:</span>   fmt.Println<span style="color: #A6E22E;">(</span>b<span style="color: #A6E22E;">)</span>
//&#21333;&#27493;&#25191;&#34892;
<span style="color: #A6E22E;">(</span>dlv<span style="color: #A6E22E;">)</span> n
&gt; main.main<span style="color: #A6E22E;">()</span> ./test8.go:8 <span style="color: #A6E22E;">(</span>PC: <span style="color: #AE81FF;">0x401022</span><span style="color: #A6E22E;">)</span>
     <span style="color: #AE81FF;">3:</span> import <span style="color: #A6E22E;">(</span>
     <span style="color: #AE81FF;">4:</span>   <span style="color: #E6DB74;">"fmt"</span>
     <span style="color: #AE81FF;">5:</span> <span style="color: #A6E22E;">)</span>
     <span style="color: #AE81FF;">6:</span> 
     <span style="color: #AE81FF;">7:</span> func main<span style="color: #A6E22E;">()</span> <span style="color: #A6E22E;">{</span>
=&gt;   <span style="color: #AE81FF;">8:</span>   fmt.Println<span style="color: #E6DB74;">(</span><span style="color: #E6DB74;">"begin==============="</span><span style="color: #E6DB74;">)</span>
     <span style="color: #AE81FF;">9:</span>   b := make<span style="color: #E6DB74;">(</span>map<span style="color: #FD971F;">[</span>string<span style="color: #FD971F;">]</span>string<span style="color: #E6DB74;">)</span>
    <span style="color: #AE81FF;">10:</span>   <span style="color: #FD971F;">b</span><span style="color: #E6DB74;">[</span><span style="color: #E6DB74;">"write"</span><span style="color: #E6DB74;">]</span> = <span style="color: #E6DB74;">"write"</span>
    <span style="color: #AE81FF;">11:</span>   <span style="color: #FD971F;">b</span><span style="color: #E6DB74;">[</span><span style="color: #E6DB74;">"black"</span><span style="color: #E6DB74;">]</span> = <span style="color: #E6DB74;">"black"</span>
    <span style="color: #AE81FF;">12:</span>   fmt.Println<span style="color: #E6DB74;">(</span>b<span style="color: #E6DB74;">)</span>
    <span style="color: #AE81FF;">13:</span> <span style="color: #A6E22E;">}</span>
<span style="color: #A6E22E;">(</span>dlv<span style="color: #A6E22E;">)</span> 
<span style="color: #FD971F;">begin</span>===============
&gt; main.main<span style="color: #A6E22E;">()</span> ./test8.go:9 <span style="color: #A6E22E;">(</span>PC: <span style="color: #AE81FF;">0x40111c</span><span style="color: #A6E22E;">)</span>
     <span style="color: #AE81FF;">4:</span>   <span style="color: #E6DB74;">"fmt"</span>
     <span style="color: #AE81FF;">5:</span> <span style="color: #F8F8F2; background-color: #272822;">)</span>
     <span style="color: #AE81FF;">6:</span> 
     <span style="color: #AE81FF;">7:</span> func main<span style="color: #66D9EF;">()</span> <span style="color: #66D9EF;">{</span>
     <span style="color: #AE81FF;">8:</span>   fmt.Println<span style="color: #A6E22E;">(</span><span style="color: #E6DB74;">"begin==============="</span><span style="color: #A6E22E;">)</span>
=&gt;   <span style="color: #AE81FF;">9:</span>   b := make<span style="color: #A6E22E;">(</span>map<span style="color: #E6DB74;">[</span>string<span style="color: #E6DB74;">]</span>string<span style="color: #A6E22E;">)</span>
    <span style="color: #AE81FF;">10:</span>   <span style="color: #FD971F;">b</span><span style="color: #A6E22E;">[</span><span style="color: #E6DB74;">"write"</span><span style="color: #A6E22E;">]</span> = <span style="color: #E6DB74;">"write"</span>
    <span style="color: #AE81FF;">11:</span>   <span style="color: #FD971F;">b</span><span style="color: #A6E22E;">[</span><span style="color: #E6DB74;">"black"</span><span style="color: #A6E22E;">]</span> = <span style="color: #E6DB74;">"black"</span>
    <span style="color: #AE81FF;">12:</span>   fmt.Println<span style="color: #A6E22E;">(</span>b<span style="color: #A6E22E;">)</span>
    <span style="color: #AE81FF;">13:</span> <span style="color: #66D9EF;">}</span>
<span style="color: #66D9EF;">(</span>dlv<span style="color: #66D9EF;">)</span> n
&gt; main.main<span style="color: #66D9EF;">()</span> ./test8.go:10 <span style="color: #66D9EF;">(</span>PC: <span style="color: #AE81FF;">0x401151</span><span style="color: #66D9EF;">)</span>
     <span style="color: #AE81FF;">5:</span> <span style="color: #F8F8F2; background-color: #272822;">)</span>
     <span style="color: #AE81FF;">6:</span> 
     <span style="color: #AE81FF;">7:</span> func main<span style="color: #AE81FF;">()</span> <span style="color: #AE81FF;">{</span>
     <span style="color: #AE81FF;">8:</span>   fmt.Println<span style="color: #66D9EF;">(</span><span style="color: #E6DB74;">"begin==============="</span><span style="color: #66D9EF;">)</span>
     <span style="color: #AE81FF;">9:</span>   b := make<span style="color: #66D9EF;">(</span>map<span style="color: #A6E22E;">[</span>string<span style="color: #A6E22E;">]</span>string<span style="color: #66D9EF;">)</span>
=&gt;  <span style="color: #AE81FF;">10:</span>   <span style="color: #FD971F;">b</span><span style="color: #66D9EF;">[</span><span style="color: #E6DB74;">"write"</span><span style="color: #66D9EF;">]</span> = <span style="color: #E6DB74;">"write"</span>
    <span style="color: #AE81FF;">11:</span>   <span style="color: #FD971F;">b</span><span style="color: #66D9EF;">[</span><span style="color: #E6DB74;">"black"</span><span style="color: #66D9EF;">]</span> = <span style="color: #E6DB74;">"black"</span>
    <span style="color: #AE81FF;">12:</span>   fmt.Println<span style="color: #66D9EF;">(</span>b<span style="color: #66D9EF;">)</span>
    <span style="color: #AE81FF;">13:</span> <span style="color: #AE81FF;">}</span>
<span style="color: #AE81FF;">(</span>dlv<span style="color: #AE81FF;">)</span> n
&gt; main.main<span style="color: #AE81FF;">()</span> ./test8.go:11 <span style="color: #AE81FF;">(</span>PC: <span style="color: #AE81FF;">0x4011bb</span><span style="color: #AE81FF;">)</span>
     <span style="color: #AE81FF;">6:</span> 
     <span style="color: #AE81FF;">7:</span> func main<span style="color: #AE81FF;">()</span> <span style="color: #AE81FF;">{</span>
     <span style="color: #AE81FF;">8:</span>   fmt.Println<span style="color: #66D9EF;">(</span><span style="color: #E6DB74;">"begin==============="</span><span style="color: #66D9EF;">)</span>
     <span style="color: #AE81FF;">9:</span>   b := make<span style="color: #66D9EF;">(</span>map<span style="color: #A6E22E;">[</span>string<span style="color: #A6E22E;">]</span>string<span style="color: #66D9EF;">)</span>
    <span style="color: #AE81FF;">10:</span>   <span style="color: #FD971F;">b</span><span style="color: #66D9EF;">[</span><span style="color: #E6DB74;">"write"</span><span style="color: #66D9EF;">]</span> = <span style="color: #E6DB74;">"write"</span>
=&gt;  <span style="color: #AE81FF;">11:</span>   <span style="color: #FD971F;">b</span><span style="color: #66D9EF;">[</span><span style="color: #E6DB74;">"black"</span><span style="color: #66D9EF;">]</span> = <span style="color: #E6DB74;">"black"</span>
    <span style="color: #AE81FF;">12:</span>   fmt.Println<span style="color: #66D9EF;">(</span>b<span style="color: #66D9EF;">)</span>
    <span style="color: #AE81FF;">13:</span> <span style="color: #AE81FF;">}</span>
//&#25171;&#21360;b&#30340;&#20540;
<span style="color: #AE81FF;">(</span>dlv<span style="color: #AE81FF;">)</span> p b
map<span style="color: #AE81FF;">[</span>string<span style="color: #AE81FF;">]</span>string <span style="color: #AE81FF;">[</span>
  <span style="color: #E6DB74;">"write"</span>: <span style="color: #E6DB74;">"write"</span>, 
<span style="color: #AE81FF;">]</span>
<span style="color: #AE81FF;">(</span>dlv<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
dlv还提供一些命令，总的来说对于简单的调试足够了。用起来还是比较方便, 不过如果调试go汇编代码，就有点不足，-0- 单步都不能使用。
</p>
</div>
</div>
